(sqlite-datumtijd)=
# Datumfuncties in SQLite

In [2]:
%LOAD ../data/employees.db

De datum- en tijdfuncties in SQLite wijken nogal af van die in (My)SQL.
Een uitgebreide beschrijving van de SQLite functies vind je hier:

* https://www.sqlite.org/lang_datefunc.html
* https://www.sqlitetutorial.net/sqlite-date-functions/sqlite-date-function/

We geven hieronder een aantal voorbeelden van veelvoorkomende gevallen.

## Datum en tijd als TEXT

De basisfuncties voor datum en tijd in TEXT-formaat (ISO-8601) zijn:

* DATE - geeft de datum (als TEXT)
* TIME - geeft de tijd, zonder datum (als TEXT)
* DATETIME - geeft de combinatie van datum en tijd (als TEXT)

Met deze functies kun je via "modifiers" ook rekenen met tijd, bijvoorbeeld 30 dagen verder, 2 maanden eerder, enzovoorts.

In [7]:
SELECT DATE('now');

+-------------+
| DATE('now') |
+-------------+
| 2023-07-05  |
+-------------+

In [26]:
SELECT DATE ('now', 'start of year');

+-------------------------------+
| DATE ('now', 'start of year') |
+-------------------------------+
| 2023-01-01                    |
+-------------------------------+

In [11]:
SELECT TIME ('now');

+--------------+
| TIME ('now') |
+--------------+
| 07:46:02     |
+--------------+

In [24]:
SELECT DATETIME('now', "+10 days")

+-----------------------------+
| DATETIME('now', "+10 days") |
+-----------------------------+
| 2023-07-28 17:22:49         |
+-----------------------------+

## Datum en tijd als getal

De volgende functies geven de datum/tijd als getal: daarmee kun je eenvoudig rekenen, als het om dagen of seconden gaat:

* JULIANDAY - geeft de datum/tijd als getal (aantal dagen sinds 12:00 uur op 24 november 4714 B.C.)
    * zie: https://nl.wikipedia.org/wiki/Juliaanse_dag
* UNIXEPOCH - geeft de datum/tijd als getal (Unix timestamp: seconden sinds 1 jan 1970)

In [25]:
SELECT JULIANDAY('now', "-1 month");

+------------------------------+
| JULIANDAY('now', "-1 month") |
+------------------------------+
| 2460114.22443712             |
+------------------------------+

In [27]:
SELECT UNIXEPOCH('now');

+------------------+
| UNIXEPOCH('now') |
+------------------+
| 1689701484       |
+------------------+

Deze getallen kun je omzetten in (ISO) TEXT-formaat met de eerder genoemde DATE/TIME/DATETIME functies:

In [19]:
SELECT DATETIME(UNIXEPOCH('now'), 'unixepoch');

+-----------------------------------------+
| DATETIME(UNIXEPOCH('now'), 'unixepoch') |
+-----------------------------------------+
| 2023-07-18 16:57:58                     |
+-----------------------------------------+

Idem, voor Juliaanse tijd (getal):

In [20]:
SELECT DATETIME(JULIANDAY('now'));

+----------------------------+
| DATETIME(JULIANDAY('now')) |
+----------------------------+
| 2023-07-18 16:58:00        |
+----------------------------+

## strftime

Met de functie `strftime(format, datetime)` kun je het TEXT-formaat van de datum/tijd aanpassen, bijvoorbeeld om een onderdeel te selecteren (zoals "dag", "maand", "jaar").

**Dag. **Met het format `%d` krijg je het nummer van de dag in de maand van een datum:

In [6]:
SELECT last_name, hire_date, strftime('%d', hire_date) as day
FROM employees
WHERE last_name = 'King';

+-----------+------------+-----+
| last_name | hire_date  | day |
+-----------+------------+-----+
| King      | 1987-06-17 | 17  |
+-----------+------------+-----+

**Weekdag.** Als je de dag in de week wilt (met zondag = 0), gebruik je `%w`:

In [22]:
SELECT last_name, hire_date, strftime('%w', hire_date) as day_in_week
FROM employees
WHERE last_name = 'King';

+-----------+------------+-------------+
| last_name | hire_date  | day_in_week |
+-----------+------------+-------------+
| King      | 1987-06-17 | 3           |
+-----------+------------+-------------+

**Maand.** Met het format `%m` haal je het nummer van de maand op van een datum.

In [10]:
SELECT last_name, hire_date, strftime('%m', hire_date) as month
FROM employees
WHERE last_name = 'King';

+-----------+------------+-------+
| last_name | hire_date  | month |
+-----------+------------+-------+
| King      | 1987-06-17 | 06    |
+-----------+------------+-------+

**Jaar.** Met het format `%Y` YEAR haal je het jaar op van een datum.

In [13]:
SELECT last_name, hire_date, strftime('%Y', hire_date) as year
FROM employees
WHERE last_name = 'King';

+-----------+------------+------+
| last_name | hire_date  | year |
+-----------+------------+------+
| King      | 1987-06-17 | 1987 |
+-----------+------------+------+

**Opmerking.** SQLite heeft geen mogelijkheid om maanden of weekdagen te benoemen. Als dat nodig is, kun je de getallen via een `CASE` constructie omzetten in de gewenste namen.